# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
cur.execute('''SELECT firstname, lastname FROM employees JOIN offices 
            USING (officeCode) WHERE city = 'Boston';''')
cur.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [4]:
#Your code here
cur.execute('''SELECT city, * FROM offices LEFT JOIN employees USING (officeCode) WHERE employeeNumber
                IS NULL;''')
cur.fetchall()

[]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [5]:
# Your code here
import pandas as pd

## Level Up: Display the names of each product each employee has sold.

In [10]:
# Your code here
cur.execute('''SELECT firstname, productName from employees e JOIN customers c 
ON c.salesRepEmployeeNumber = e.employeeNumber JOIN orders o USING (customerNumber)
JOIN orderdetails od USING (orderNumber) JOIN products p USING (productCode);''') 

df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()

2996

        0                                            1
0  Leslie                               1958 Setra Bus
1  Leslie                       1940 Ford Pickup Truck
2  Leslie                      1939 Cadillac Limousine
3  Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [9]:
df.groupby([0,1]).count()

Empty DataFrame
Columns: []
Index: [(Andy, 18th Century Vintage Horse Carriage), (Andy, 1900s Vintage Bi-Plane), (Andy, 1900s Vintage Tri-Plane), (Andy, 1911 Ford Town Car), (Andy, 1913 Ford Model T Speedster), (Andy, 1917 Grand Touring Sedan), (Andy, 1917 Maxwell Touring Car), (Andy, 1926 Ford Fire Engine), (Andy, 1928 British Royal Navy Airplane), (Andy, 1928 Ford Phaeton Deluxe), (Andy, 1928 Mercedes-Benz SSK), (Andy, 1930 Buick Marquette Phaeton), (Andy, 1932 Alfa Romeo 8C2300 Spider Sport), (Andy, 1932 Model A Ford J-Coupe), (Andy, 1934 Ford V8 Coupe), (Andy, 1936 Chrysler Airflow), (Andy, 1936 Harley Davidson El Knucklehead), (Andy, 1936 Mercedes Benz 500k Roadster), (Andy, 1936 Mercedes-Benz 500K Special Roadster), (Andy, 1937 Horch 930V Limousine), (Andy, 1937 Lincoln Berline), (Andy, 1938 Cadillac V-16 Presidential Limousine), (Andy, 1939 Cadillac Limousine), (Andy, 1939 Chevrolet Deluxe Coupe), (Andy, 1940 Ford Pickup Truck), (Andy, 1940s Ford truck), (Andy, 1941 Chevrolet Special Deluxe Cabriolet), (Andy, 1948 Porsche 356-A Roadster), (Andy, 1948 Porsche Type 356 Roadster), (Andy, 1949 Jaguar XK 120), (Andy, 1950's Chicago Surface Lines Streetcar), (Andy, 1952 Alpine Renault 1300), (Andy, 1952 Citroen-15CV), (Andy, 1956 Porsche 356A Coupe), (Andy, 1957 Corvette Convertible), (Andy, 1957 Ford Thunderbird), (Andy, 1957 Vespa GS150), (Andy, 1958 Setra Bus), (Andy, 1960 BSA Gold Star DBD34), (Andy, 1961 Chevrolet Impala), (Andy, 1962 LanciaA Delta 16V), (Andy, 1964 Mercedes Tour Bus), (Andy, 1965 Aston Martin DB5), (Andy, 1966 Shelby Cobra 427 S/C), (Andy, 1968 Ford Mustang), (Andy, 1969 Chevrolet Camaro Z28), (Andy, 1969 Dodge Super Bee), (Andy, 1969 Harley Davidson Ultimate Chopper), (Andy, 1970 Chevy Chevelle SS 454), (Andy, 1970 Dodge Coronet), (Andy, 1970 Plymouth Hemi Cuda), (Andy, 1970 Triumph Spitfire), (Andy, 1971 Alpine Renault 1600s), (Andy, 1974 Ducati 350 Mk3 Desmo), (Andy, 1976 Ford Gran Torino), (Andy, 1980’s GM Manhattan Express), (Andy, 1982 Camaro Z28), (Andy, 1982 Ducati 900 Monster), (Andy, 1982 Ducati 996 R), (Andy, 1982 Lamborghini Diablo), (Andy, 1992 Ferrari 360 Spider red), (Andy, 1992 Porsche Cayenne Turbo Silver), (Andy, 1993 Mazda RX-7), (Andy, 1995 Honda Civic), (Andy, 1996 Moto Guzzi 1100i), (Andy, 1996 Peterbilt 379 Stake Bed with Outrigger), (Andy, 1997 BMW F650 ST), (Andy, 1997 BMW R 1100 S), (Andy, 1999 Indy 500 Monte Carlo SS), (Andy, 2002 Chevy Corvette), (Andy, 2002 Suzuki XREO), (Andy, 2002 Yamaha YZR M1), (Andy, 2003 Harley-Davidson Eagle Drag Bike), (Andy, ATA: B757-300), (Andy, America West Airlines B757-200), (Andy, American Airlines: B767-300), (Andy, American Airlines: MD-11S), (Andy, Boeing X-32A JSF), (Andy, Corsair F4U ( Bird Cage)), (Andy, F/A 18 Hornet 1/72), (Andy, HMS Bounty), (Andy, P-51-D Mustang), (Barry, 18th Century Vintage Horse Carriage), (Barry, 18th century schooner), (Barry, 1900s Vintage Bi-Plane), (Barry, 1900s Vintage Tri-Plane), (Barry, 1903 Ford Model A), (Barry, 1904 Buick Runabout), (Barry, 1912 Ford Model T Delivery Wagon), (Barry, 1913 Ford Model T Speedster), (Barry, 1917 Maxwell Touring Car), (Barry, 1926 Ford Fire Engine), (Barry, 1928 British Royal Navy Airplane), (Barry, 1928 Ford Phaeton Deluxe), (Barry, 1928 Mercedes-Benz SSK), (Barry, 1930 Buick Marquette Phaeton), (Barry, 1932 Model A Ford J-Coupe), (Barry, 1934 Ford V8 Coupe), (Barry, 1936 Chrysler Airflow), (Barry, 1936 Harley Davidson El Knucklehead), ...]

[1297 rows x 0 columns]

In [40]:
#Your code here
cur.execute('''SELECT firstname, quantityOrdered from employees e JOIN customers c
ON e.employeeNumber = c.salesRepEmployeeNumber JOIN orders o USING (customerNumber)
JOIN orderdetails USING (orderNumber);''')
df = pd.DataFrame(cur.fetchall())

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!